In [51]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

In [52]:
df = pd.read_csv("../data/total_production_V2.csv")
df

                country    group  year  units
0                angola    April  1990     50
1               bolivia    April  1990    123
2                brazil    April  1990  27286
3               burundi    April  1990    487
4               ecuador    April  1990   1504
...                 ...      ...   ...    ...
1645  trinidad & tobago  October  2019     12
1646             uganda  October  2019   5509
1647          venezuela  October  2019    650
1648           viet nam  October  2019  30487
1649              yemen  October  2019     91

[1650 rows x 4 columns]

In [53]:
# 1. Columns of interest
df.head()

   country  group  year  units
0   angola  April  1990     50
1  bolivia  April  1990    123
2   brazil  April  1990  27286
3  burundi  April  1990    487
4  ecuador  April  1990   1504

In [54]:
# Compute averge units by year
avg_by_year = df.groupby(["year"])["units"].mean()
avg_by_year.head()

year
1990    1695.090909
1991    1841.254545
1992    1791.290909
1993    1668.345455
1994    1696.618182
Name: units, dtype: float64

In [55]:
# Compute average units by year, group
avg_by_year_group = df.groupby(["year", "group"])["units"].mean()
avg_by_year_group.head()

year  group
1990  April      2914.000000
      July        517.000000
      October    1435.735294
1991  April      3037.785714
      July        418.000000
Name: units, dtype: float64

In [56]:
# 2. Exploring individual columns
def get_col_insight(column_name):
  # Comput null values, calculate total length of null, calculate percentage of relative null values for column
  null_values = df[df[column_name].isna()]
  total_length = df.size
  null_percentage = null_values.size / total_length

  print(f"Column_name: {column_name}"); print(f"Null Percentage: {null_percentage}")
  
  display(null_values)

In [57]:
# Get column names from df
cols = df.columns.to_list()

In [58]:
# Check for null values for each column
for col in cols:
  get_col_insight(col)

Column_name: country
Null Percentage: 0.0

Empty DataFrame
Columns: [country, group, year, units]
Index: []

Column_name: group
Null Percentage: 0.0

Empty DataFrame
Columns: [country, group, year, units]
Index: []

Column_name: year
Null Percentage: 0.0

Empty DataFrame
Columns: [country, group, year, units]
Index: []

Column_name: units
Null Percentage: 0.0

Empty DataFrame
Columns: [country, group, year, units]
Index: []

In [64]:
# WIP, get distribution per group...
df[(df["year"] == 2000) & (df["country"] == "ecuador")][["country", "units", "year"]]

     country  units  year
554  ecuador    854  2000

In [61]:
# 3. Plotting 2d distributions of variables of interest vs target variables

In [62]:
# 4. Analyzing correlations between independent and dependent variables